//*******************************FILE HEAD**************************************
//*********************《Verilog HDL 设计与实战》配套源代码*********************
// FILE NAME       : crc_three_tb.v
// FUNCTION        : CRC编码方式三模块测试平台
// AUTHOR          : 
// DATE & REVISION : 
// COMPANY         : 《Verilog HDL 设计与实战》
// UPDATE          :
//******************************************************************************
`timescale 1ns/1ns

module crc_three_tb();      
    
    reg [2 : 0] r_data;
    
    wire [3 : 0] w_crc_code;    //CRC编码信号 

       

//*********************************PROCESS**************************************
// FUNCTION        :初始化r_data
//******************************************************************************     
    initial
    begin
            r_data = 1'b0;
        forever
            #1  r_data = r_data + 3'd1;
    end

//*********************************PROCESS**************************************
// FUNCTION        :实例化CRC编码模块crc_three
//******************************************************************************     
    crc_three I1_crc_three(
                        .i_data(r_data),
                        .o_crc_code(w_crc_code)
                      );
    
endmodule
// END OF data_encrypt.v FILE *********************************************************
                 
       
            
    
    

