//*******************************FILE HEAD**************************************
//*********************《Verilog HDL 设计与实战》配套源代码*********************
// FILE NAME       : string_test.v
// FUNCTION        : 字符串测试
// AUTHOR          : 
// DATE & REVISION : 
// COMPANY         : 《Verilog HDL 设计与实战》————北京航空航天大学出版社
// UPDATE          :
//******************************************************************************
module string_test;
    reg [19*8 : 0] a;   //定义一个变量存储字符串

//*********************************PROCESS**************************************
// FUNCTION        :显示字符串的存储方式
//******************************************************************************      
    initial
    begin
        a = "I love Verilog HDL!";
        $display("a is :%H", a);
    end
endmodule


