//*******************************FILE HEAD**************************************
//*********************《Verilog HDL 设计与实战》配套源代码*********************
// FILE NAME       : crc_two_tb.v
// FUNCTION        : CRC编码方式一模块测试平台
// AUTHOR          : 
// DATE & REVISION : 
// COMPANY         : 《Verilog HDL 设计与实战》
// UPDATE          :
//******************************************************************************
`timescale 1ns/1ns

module crc_two_tb();      

    
    reg r_rst_n;
    reg r_clk;
    reg r_data;
    
    wire w_crc_code;    //CRC编码信号  
    wire w_crc_done;    //CRC编码完成信号

       
//*********************************PROCESS**************************************
// FUNCTION        :初始化r_rst_n
//******************************************************************************     
    initial
    begin
            r_rst_n = 1'b0;
        #10 r_rst_n = 1'b1; 
    end

//*********************************PROCESS**************************************
// FUNCTION        :初始化r_clk,产生周期为2ns的时钟信号
//******************************************************************************     
    initial
    begin
            r_clk = 1'b0;
        forever
            #1  r_clk = ~r_clk;
    end
//*********************************PROCESS**************************************
// FUNCTION        :初始化r_data
//******************************************************************************     
    initial
    begin
            r_data = 1'b0;
        forever
            #2  r_data = $random() % 2;
    end

//*********************************PROCESS**************************************
// FUNCTION        :实例化CRC编码模块crc_two
//******************************************************************************     
    crc_two I1_crc_two(
                        .i_rst_n(r_rst_n),
                        .i_clk(r_clk),
                        .i_data(r_data),
                        .o_crc_code(w_crc_code),
                        .o_crc_done(w_crc_done)
                      );
    
endmodule
// END OF data_encrypt.v FILE *********************************************************
                 
       
            
    
    
