//*******************************FILE HEAD**************************************
//*********************《Verilog HDL 设计与实战》配套源代码*********************
// FILE NAME       : half_adder.v
// FUNCTION        : 半加法器建模
// AUTHOR          : 
// DATE & REVISION : 
// COMPANY         : 《Verilog HDL 设计与实战》————北京航空航天大学出版社
// UPDATE          :
//******************************************************************************
module half_adder(
    input I_a,      //加数1
    input I_b,      //加数2
    
    output O_sum,   //和
    output O_cout   //进位信号
);


//*********************************PROCESS**************************************
// FUNCTION        :半加法器的逻辑实现
//****************************************************************************** 
    assign O_sum = I_a ^ I_b;
    assign O_cout = I_a & I_b;
    
endmodule


