
//*******************************FILE HEAD**************************************
//*********************?Verilog HDL ???????????*********************
// FILE NAME       : counter_tbt.v
// FUNCTION        : counter.v模块的测试平台
// AUTHOR          : 
// DATE & REVISION : 
// COMPANY         : 《Verilog HDL 设计与实战》————北京航空航天大学出版社
// UPDATE					 : 
//******************************************************************************
`timescale 1ns/1ns

module counter_tb();
    
    reg rst_n;
    reg clk;
    
    wire [7 : 0] cnt;
    wire cout;

//实例化被测试模块counter    
    counter I1_counter(
        .I_rst_n(rst_n),
        .I_clk(clk),
        .O_cnt(cnt),
        .O_cout(cout)
        );

//*********************************PROCESS**************************************
// FUNCTION        :初始化时钟信号clk，复位信号rst_n
//******************************************************************************        
    initial
    begin
        clk = 1'b0;
        rst_n = 1'b0;
        #4 rst_n = 1'b1;
    end
    
//*********************************PROCESS**************************************
// FUNCTION        :产生周期为2ns的时钟信号
//******************************************************************************    
    always #1 clk <= ~clk;
    
endmodule
// END OF count.v FILE *********************************************************


        
        